USE Kuznetsov_Efimov_P_36_2;
INSERT INTO Groops VALUES
('А-10',1),('Б-20',2),('В-30',3),('Г-40',4),('Д-50',5);
INSERT INTO Spec VALUES
(1,'Врач'),(2,'Программист'),(3,'Дизайнер'),(4,'Педагог'),(5,'Маркетолог');
INSERT INTO Students VALUES
('001','Молчанова','Вероника ','Павловна','А-10'),   ('002','Сальников ','Константин ','Алексеевич','А-10'),
('003','Львова ','Карина ','Александровна','А-10'),  ('004','Мартынов ','Кирилл ','Матвеевич','Б-20'),
('005','Ковалев ','Ярослав ','Егорович','Б-20'),     ('006','Гончаров ','Максим ','Максимович','Б-20'),
('007','Федотова ','Елизавета ','Георгиевна','В-30'),('008','Иванов ','Алексей ','Маркович','В-30'),
('009','Панов ','Макар ','Тимурович','В-30'),        ('010','Яковлев','Валерий ','Денисович','Г-40'),
('011','Иванова ','Дарья ','Ибрагимовна','Г-40'),    ('012','Игнатьева ','Вероника ','Максимовна','Г-40'),
('013','Иванова ','Мия ','Максимовна','Д-50'),       ('014','Ковалев ','Константин ','Михайлович','Д-50'),
('015','Григорьев ','Георгий ','Иванович','Д-50');   
INSERT INTO Sessia VALUES
('001','Анатомия','2022-06-02',5),('002','Анатомия','2022-06-03',5),('003','Анатомия','2022-06-04',5),
('004','Программирование','2022-06-02',5),('005','Программирование','2022-06-03',5),('006','Программирование','2022-06-04',5),
('007','Многостраничный дизайн','2022-06-02',3),('008','Многостраничный дизайн','2022-06-03',3),('009','Многостраничный дизайн','2022-06-04',3),
('010','Дошкольная педагогика','2022-06-02',5),('011','Дошкольная педагогика','2022-06-03',5),('012','Дошкольная педагогика','2022-06-04',2),
('013','Бухгалтерский учет','2022-06-02',2),('014','Бухгалтерский учет','2022-06-03',2),('015','Бухгалтерский учет','2022-06-04',3),

('001','Акушерство и гинекология','2022-06-02',5),('002','Акушерство и гинекология','2022-06-03',5),('003','Акушерство и гинекология','2022-06-04',5),
('004','Веб-технологии','2022-06-02',5),('005','Веб-технологии','2022-06-03',5),('006','Веб-технологии','2022-06-04',5),
('007','Дизайн упаковки','2022-06-02',3),('008','Дизайн упаковки','2022-06-03',3),('009','Дизайн упаковки','2022-06-04',3),
('010','Дефектология','2022-06-02',4),('011','Дефектология','2022-06-03',4),('012','Дефектология','2022-06-04',3),
('013','Эконометрика','2022-06-02',2),('014','Эконометрика','2022-06-03',2),('015','Эконометрика','2022-06-04',5),

('001','Гигиена','2022-06-02',5),('002','Гигиена','2022-06-03',5),('003','Гигиена','2022-06-04',5),
('004','Тестирование программного обеспечения','2022-06-02',5),('005','Тестирование программного обеспечения','2022-06-03',5),('006','Тестирование программного обеспечения','2022-06-04',5),
('007','Информационный дизайн и медиа','2022-06-02',3),('008','Информационный дизайн и медиа','2022-06-03',3),('009','Информационный дизайн и медиа','2022-06-04',3),
('010','Детская литература','2022-06-02',3),('011','Детская литература','2022-06-03',3),('012','Детская литература','2022-06-04',4),
('013','Статистика','2022-06-02',2),('014','Статистика','2022-06-03',2),('015','Статистика','2022-06-04',3),

('001','Физкультура','2022-06-02',5),('002','Физкультура','2022-06-03',5),('003','Физкультура','2022-06-04',5),
('004','Физкультура','2022-06-02',5),('005','Физкультура','2022-06-03',5),('006','Физкультура','2022-06-04',5),
('007','Физкультура','2022-06-02',3),('008','Физкультура','2022-06-03',3),('009','Физкультура','2022-06-04',3),
('010','Физкультура','2022-06-02',2),('011','Физкультура','2022-06-03',2),('012','Физкультура','2022-06-04',5),
('013','Физкультура','2022-06-02',2),('014','Физкультура','2022-06-03',2),('015','Физкультура','2022-06-04',5);
INSERT INTO uch_plan VALUES
(1,'Анатомия'),(2,'Программирование'),(3,'Дизайн упаковки'),(4,'Дошкольная педагогика'),(5,'Бухгалтерский учет'),
(1,'Акушерство и гинекология'),(2,'Веб-технологии'),(3,'Информационный дизайн и медиа'),(4,'Дефектология'),(5,'Эконометрика'),
(1,'Гигиена'),(2,'Тестирование программного обеспечения'),(3,'Многостраничный дизайн'),(4,'Детская литература'),(5,'Статистика'),
(1,'Физкультура'),(2,'Физкультура'),(3,'Физкультура'),(4,'Физкультура'),(5,'Физкультура');
